Repository: lucas27-01/data_storage
Catalog: lib/l10n/app_*.arb
Languages: it

# settingsPageName
source: Settings
it: Impostazioni

# funNotImplemented
source: Function not implemented, yet
it: Funzione non implementata, per ora

source: Theme
it: Tema

# darkModeWithColon
source: Dark mode:
it: Modalità scura:

# themeColorWithColon
source: Theme color:
it: Colore del tema:

# lang
source: Language
it: Lingua

# langWithColon
source: Language:
it: Lingua:

# color
source: {color, select, amber{Amber} blue{Blue} red{Red} cyan{Cyan} green{Green} yellow{Yellow} orange{Orange} blueGrey{Blue grey} purple{Purple} indigo{Indigo} lime{Lime} pink{Pink} teal{Teal} other{{color}}}
it: {color, select, amber{Ambra} blue{Blu} red{Rosso} cyan{Ciano} green{Verde} yellow{Giallo} orange{Arancione} blueGrey{Grigio blu} purple{Viola} indigo{Indaco} lime{Lime} pink{Rosa} teal{Turchese} other{{color}}}

source: Add Storage
it: Aggiungi Raccolta

source: Add Storage from Template
it: Aggiungi Raccolta da Template

source: Create Data Storage
it: Crea Raccolta Dati

# attenction
source: Attenction please!
it: Attenzione, perfavore!

source: Yes, I want
it: Sì, lo voglio

source: No, stay
it: No, rimani

# questionDeleteCreationDS
source: Do you really want to delete the creation of the data collection?
it: Vuoi veramente cancellare la creazione della Raccolta Dati?

# questionDeleteDataStorage
source: Do you really want to delete the data collection?
it: Vuoi veramente eliminare la Raccolta Dati?

# genericCreateInfo
source: This is a generic section: here you can edit the entire Data Storage properties and not a single Data. If you want to edit and/or add Data(s) you should go to the Data section.
it: Questa è una sezione generica: qua puoi modificare proprietà dell'intera raccolta dati e non di un singolo dato. Se vuoi modificare e/o aggiungere Dati devi andare nella sezione "Dati".

source: Name
it: Nome

source: Data Storage Name
it: Nome della Raccolta Dati

source: Description
it: Descrizione

source: Data Storage Description
it: Descrizione della Raccolta Dati

source: Icon
it: Icona

# selIcon
source: Select an icon
it: Seleziona un'icona

source: Save and Continue
it: Salva e Continua

# selType
source: Select a Type
it: Seleziona un Tipo

source: Cancel
it: Annulla

# continuing
source: Continue
it: Continua

source: Add Data
it: Aggiungi Dato

source: Generic
it: Generali

source: Data
it: Dati

# questionDeleteAddingIntegerType
source: Do you really want to delete the creation of an integer data at your Data Storage?
it: Vuoi veramente cancellare l'aggiunta di un dato di tipo Intero alla tua raccolta dati?

source: Integer Data Adding
it: Aggiunta Dato Intero

source: Data Settings
it: Impostazioni Dato

source: Data Name
it: Nome del Dato

source: Data Description
it: Descrizione del Dato

source: Default Value
it: Valore Predefinito

source: Data Default Value
it: Valore Predefinito del Dato

source: Constraints Settings
it: Impostazioni Limiti

source: Max Value
it: Valore Massimo

source: Data Max Value
it: Valore Massimo del Dato

source: Min Value
it: Valore Minimo

source: Data Min Value
it: Valore Minimo del Dato

source: Multiple of
it: Multiplo di

source: Value Multiple of
it: Valore Multiplo di

source: Save and Add
it: Salva e Aggiungi

# questionDeleteAddingStringType
source: Do you really want to delete the creation of a string data at your Data Storage?
it: Vuoi veramente cancellaree l'aggiunta di un Dato di tipo Stringa alla tua Raccolta Dati?

source: String Data Adding
it: Aggiunta Dato tipo Stringa

source: Min Length
it: Lunghezza Minima

source: Data Min Length
it: Lunghezza Minima del Dato

source: Max Length
it: Lunghezza Massima

source: Data Max Length
it: Lunghezza Massima del Dato

source: Only Alphabetical
it: Solo Alfabetico

# subtitleOnlyAphabetical
source: No numbers, special chars, etc...
it: Nessun numero, carattere speciale, ecc...

# questionDeleteAddingDecimalType
source: Do you really want to delete the creation of a decimal data at your Data Storage?
it: Vuoi veramente cancellaree l'aggiunta di un Dato di tipo Decimale alla tua Raccolta Dati?

source: Decimal Data Adding
it: Aggiunta Dato Decimale

# representableType
source: {type, select, other{type {type}} integer{Integer} decimal{Decimal} string{String} boolean{Boolean} time_{Time} date_{Date} }
it: {type, select, other{tipo {type}} integer{Intero} decimal{Decimale} string{Stringa} boolean{Buleano}}

source: Historic
it: Storico

source: Historic of
it: Storico di

# questionDataStorageCreationComplete
source: Are you really sure you have completed the Data Storage creation? Several properties and preferencies will no longer be changed.
it: Sei sicuro di aver completato la creazione della tua Raccolta Dati? Molte proprietà e preference non potranno più essere modificate.

# delete
source: Elimina
it: Delete

# confirmDeleteData
source: Do you really want to delete the Data {dataName} (description: {dataDescription})?
it: Vuoi veramente rimuovere il Dato {dataName} (descrizione: {dataDescription})?

# statsToSeeInHistoric
source: Stats to see in Historic Page
it: Statisiche da vedere nella pagina Storico

# questionStatsToSee
source: Stats to See?
it: Statistiche?

# explainIntegerStatsToSee
source: These are the stats that will be shown in the Data Storage Historic Page (after creating and adding the Data Storage). You select those interest you (also none or all): The "Total Values Number" is the number of values; The "Total Sum" is the result that you get by summing up each values; The "Mean" is the mean (or average) of Data Storage values (when added); The "Median" is the value that is in the value list center when the list is sorted; The "Mode" is the number that most often appear; The "Min Value" and the "Max Value" are the min and the max values in the list; The "Standard Deviation" mean how far they are on average from the value mean; The "Range" is the difference between the max and the min value.
it: Queste sono le statistiche che verramo mostrate nella pagina Storico della Raccolta Dati (dopo averla creata e aggiunta). Seleziona qulle che ti interessano (anche nessuna o tutte): La "Media" è la media di tutti i valori di questo dato (quando aggiunti); La "Mediana" è il valore al centro quando la lista dei valori è ordinata; La "Moda" è il numero che appare più frequentemente tra i valori; Il "Valore Minimo" e il "Valore Massimo" sono appunto il valore minimo e massimo tra i valori; La "Deviazione Standard" indica quanto i valori si discostano mediamente dalla media dei valori; Il "Range" è la differenza tra il valore massimo e il valore minimo della lista di valori.

# explainStringStatsToSee
source: These are the stats that will be shown in the Data Storage Historic Page (after creating and adding the Data Storage). You select those interest you (also none or all): The "Total Values Number" is the number of values; The "Mode" is the most frequent string of Data Storage values (when added); The "Mean Lenght" is the average of every string lenght; The "Shorter String" and the "Longer String" are the shorter and the longer string.
it: Queste sono le statistiche che verramo mostrate nella pagina Storico della Raccolta Dati (dopo averla creata e aggiunta). Seleziona qulle che ti interessano (anche nessuna o tutte): La "Moda" è la Stringa che appare più frequentemente tra i valori; La "Lunghezza Media" è la media delle lunghezze di ogni stringa;" La "Stringa Più Corta" e la "Stringa Più Lunga" sono appunto la più corta e la più lunga tra le stringhe.

# explainBooleanStatsToSee
source: These are the stats that will be shown in the Data Storage Historic Page (after creating and adding the Data Storage). You select those interest you (also none or all): The "Total Values Number" is the number of values; The "Mode" is the most frequent value (true or false) of Data Storage values (when added); The "True Number" is the number of occurency of the true value in the values; The "False Number" is the number of occurency of the false value in the values.
it: Queste sono le statistiche che verramo mostrate nella pagina Storico della Raccolta Dati (dopo averla creata e aggiunta). Seleziona qulle che ti interessano (anche nessuna o tutte): Il "Numero Totale di Valori" è il numero di valori; La "Moda" è il valore (vero o falso) che appare più frequentemente tra i valori Il "Numero di Veri" è il numero di occorrenze false che appare nei valori; Il "Numero di Falsi" è il numero di occorrenze false che appare nei valori.

# statTerms
source: {term, select, other{{term}} totalValuesNum{Total Values Number} mean{Mean} median{Median} mode{Mode} maxValue{Max Value} minValue{Min Value} standardDeviation{Standard Deviation} range{Range} meanLenght{Mean Lenght} longerValue{Longer String} shorterValue{Shorter String} trueNum{True Number} falseNum{False Number} hourMean{Hour Mean} minuteMean{Minute Mean} totalSum{Total Sum} yearMean{Year Mean} monthMean{Month Mean} dayMean{Day Mean} }
it: {term, select, other{{term}} totalValuesNum{Numero di Valori Totali} mean{Media} median{Mediana} mode{Moda} maxValue{Valore Massimo} minValue{Valore Minimo} standardDeviation{Deviazione Standard} range{Range} meanLenght{Lunghezza Media} longerValue{Stringa Più Lunga} shorterValue{Striga Più Corta} trueNum{Numero di Veri} falseNum{Numero di Falsi}}

source: Edit
it: Modifica

source: Type
it: Tipo

# viewerOf
source: {name} viewer
it: Visualizzatore di {name}

source: No Data
it: Nessun Dato

# modeWithOccurrences
source: {mode} with {occurrences} occurrences
it: {mode} con {occurrences} occorrenze

source: Integer Value
it: Valore Intero

# multipleOfNum
source: The value has to be multiple of {multiple}
it: Il valore deve essere multiplo di {multiple}

source: Decimal Value
it: Valore Decimale

# stringWithChars
source: {numberOfChars, plural, other{{string} with {numberOfChars} characters} =0{{string} with no characters} =1{{string} with 1 character}}
it: {numberOfChars, plural, other{{string} con {numberOfChars} caratteri} =0{{string} senza caratteri} =1{{string} con 1 carattere}}

# numberOfCharacters
source: {chars, plural, other{{chars} characters} =0{no chars} =1{1 character} }
it: {chars, plural, other{{chars} caratteri} =0{senza caratteri} =1{1 carattere} }

source: String Value
it: Valore di tipo Stringa

source: No Default Value
it: Nessun Valore Predefinito

source: True
it: Vero

source: False
it: Falso

source: Boolean Value
it: Valore Buleano

source: Locale
it: Localizzazione

source: Date Format
it: Formato Data

# use24H
source: Use 24 Hour format
it: Usare formato 24 Ore

# explaint24H
source: 24 Hour format or AM/PM
it: Formato 24 ore o AM/PM

source: Your Data
it: I tuoi Dati

# explainDateTimeFormats
source: How to display the date. With the current format today's date would be {dateTimeLocalized}
it: Come mostrare la data. on il formato corrente la data odierna sarebbe {dateTimeLocalized}

# cannotCreateFile
source: Couldn't create file
it: Impossibile creare il file

source: File Creation Error
it: Errore nella Creazione del File

source: Export Collections
it: Esporta Collezioni

# allCollectionsImported
source: Every Collection Imported
it: Tutte le Collezioni Importate

source: Cannot load file content
it: Impossibile caricare il contenuto del file

source: File Load Error
it: Errore nel Caricamente del File

source: Import Collections
it: Importa Collezioni

# typeErrFileContent
source: Type Error: the type {runtimeType} is not a valid type. The content of the imported file is: {fileContent}
it: Errore di Tipo: il tipo {runtimeType} non è un tipo valido. Il contenuto del file importato è: {fileContent}

# fileErrImportEmpty
source: File Content Error (not fatal): the file seems to be empty and for this it cannot be imported. The content is {fileContent}
it: Errore nel Contenuto del File (non fatale): il file sembrerebbe essere vuoto e pre questo non può essere importato. Il contenuto del file è {fileContent}

source: See why
it: Vedi perché

# fileCreatedAt
source: File created at {filePath}
it: File creato in {filePath}
